from app import app
from models import db, Book

books = [

("1984","Джордж Оруэлл",1949),
("Мастер и Маргарита","Михаил Булгаков",1967),
("Преступление и наказание","Фёдор Достоевский",1866),
("Война и мир","Лев Толстой",1869),
("Три товарища","Эрих Мария Ремарк",1936),
("Над пропастью во ржи","Джером Сэлинджер",1951),
("Гарри Поттер и философский камень","Дж. К. Роулинг",1997),
("Убить пересмешника","Харпер Ли",1960),
("451 градус по Фаренгейту","Рэй Брэдбери",1953),
("Маленький принц","Антуан де Сент-Экзюпери",1943),

("Шерлок Холмс","Артур Конан Дойл",1892),
("О дивный новый мир","Олдос Хаксли",1932),
("Мы","Евгений Замятин",1924),
("Дюна","Фрэнк Герберт",1965),
("Хоббит","Джон Толкин",1937),
("Властелин колец","Джон Толкин",1954),
("Анна Каренина","Лев Толстой",1877),
("Идиот","Фёдор Достоевский",1869),
("Портрет Дориана Грея","Оскар Уайльд",1890),
("Триумфальная арка","Эрих Мария Ремарк",1945)

]

with app.app_context():

    for title, author, year in books:

        exists = Book.query.filter_by(
            title=title
        ).first()

        if not exists:

            db.session.add(
                Book(
                    title=title,
                    description="Описание книги.",
                    year=year,
                    publisher="Издательство",
                    author=author,
                    pages=300
                )
            )

    db.session.commit()

print("20 книг добавлены.")